RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_rcu.h
/* peripheral clock enable when sleep mode*/
typedef enum {
    /* AHB1 peripherals */
    RCU_USBHS0_SLP      = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 14U),                 /*!< USBHS0 clock when sleep mode */
    RCU_USBHS0ULPI_SLP  = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 15U),                 /*!< USBHS0ULPI clock when sleep mode */
    RCU_SRAM0_SLP       = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 16U),                 /*!< SRAM0 clock when sleep mode */
    RCU_SRAM1_SLP       = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 17U),                 /*!< SRAM1 clock when sleep mode */
    RCU_DMA0_SLP        = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 21U),                 /*!< DMA0 clock when sleep mode */
    RCU_DMA1_SLP        = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 22U),                 /*!< DMA1 clock when sleep mode */
    RCU_DMAMUX_SLP      = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 23U),                 /*!< DMAMUX clock when sleep mode */
    RCU_USBHS1_SLP      = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 29U),                 /*!< USBHS1 clock when sleep mode */
    RCU_USBHS1ULPI_SLP  = RCU_REGIDX_BIT(AHB1SPEN_REG_OFFSET, 30U),                 /*!< USBHS1ULPI clock when sleep mode */
    /* AHB2 peripherals */
    RCU_FAC_SLP         = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 1U),                  /*!< FAC clock when sleep mode */
    RCU_CAU_SLP         = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 3U),                  /*!< CAU clock when sleep mode */
    RCU_HAU_SLP         = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 4U),                  /*!< HAU clock when sleep mode */
    RCU_TRNG_SLP        = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 6U),                  /*!< TRNG clock when sleep mode */
    RCU_TMU_SLP         = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 7U),                  /*!< TMU clock when sleep mode */
    RCU_RAMECCMU1_SLP   = RCU_REGIDX_BIT(AHB2SPEN_REG_OFFSET, 8U),                  /*!< RAMECCMU1 clock when sleep mode */
    /* AHB3 peripherals */
    RCU_EXMC_SLP        = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 0U),                  /*!< EXMC clock when sleep mode */
    RCU_MDMA_SLP        = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 3U),                  /*!< MDMMA clock when sleep mode */
    RCU_OSPIM_SLP       = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 4U),                  /*!< OSPIM clock when sleep mode */
    RCU_OSPI0_SLP       = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 5U),                  /*!< OSPI0 clock when sleep mode */
    RCU_OSPI1_SLP       = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 6U),                  /*!< OSPI1 clock when sleep mode */
    RCU_RAMECCMU0_SLP   = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 10U),                 /*!< RAMECCMU0 clock when sleep mode */
    RCU_AXISRAM_SLP     = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 14U),                 /*!< AXISRAM clock when sleep mode */
    RCU_FMC_SLP         = RCU_REGIDX_BIT(AHB3SPEN_REG_OFFSET, 15U),                 /*!< FMC clock when sleep mode */
    /* AHB4 peripherals */
    RCU_GPIOA_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 0U),                  /*!< GPIOA clock when sleep mode */
    RCU_GPIOB_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 1U),                  /*!< GPIOB clock when sleep mode */
    RCU_GPIOC_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 2U),                  /*!< GPIOC clock when sleep mode */
    RCU_GPIOD_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 3U),                  /*!< GPIOD clock when sleep mode */
    RCU_GPIOE_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 4U),                  /*!< GPIOE clock when sleep mode */
    RCU_GPIOF_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 5U),                  /*!< GPIOF clock when sleep mode */
    RCU_GPIOG_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 6U),                  /*!< GPIOG clock when sleep mode */
    RCU_GPIOH_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 7U),                  /*!< GPIOH clock when sleep mode */
    RCU_GPIOJ_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 8U),                  /*!< GPIOJ clock when sleep mode */
    RCU_GPIOK_SLP       = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 9U),                  /*!< GPIOK clock when sleep mode */
    RCU_BKPSRAM_SLP     = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 13U),                 /*!< BKPSRAM clock when sleep mode */
    RCU_CRC_SLP         = RCU_REGIDX_BIT(AHB4SPEN_REG_OFFSET, 14U),                 /*!< CRC clock when sleep mode */
    /* APB1 peripherals */
    RCU_TIMER1_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 0U),                  /*!< TIMER1 clock when sleep mode */
    RCU_TIMER2_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 1U),                  /*!< TIMER2 clock when sleep mode */
    RCU_TIMER3_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 2U),                  /*!< TIMER3 clock when sleep mode */
    RCU_TIMER4_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 3U),                  /*!< TIMER4 clock when sleep mode */
    RCU_TIMER5_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 4U),                  /*!< TIMER5 clock when sleep mode */
    RCU_TIMER6_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 5U),                  /*!< TIMER6 clock when sleep mode */
    RCU_TIMER22_SLP     = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 6U),                  /*!< TIMER22 clock when sleep mode */
    RCU_TIMER23_SLP     = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 7U),                  /*!< TIMER23 clock when sleep mode */
    RCU_TIMER50_SLP     = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 10U),                 /*!< TIMER50 clock when sleep mode */
    RCU_TIMER51_SLP     = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 11U),                 /*!< TIMER51 clock when sleep mode */
    RCU_SPI1_SLP        = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 14U),                 /*!< SPI1 clock when sleep mode */
    RCU_SPI2_SLP        = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 15U),                 /*!< SPI2 clock when sleep mode */
    RCU_USART1_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 17U),                 /*!< USART1 clock when sleep mode */
    RCU_USART2_SLP      = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 18U),                 /*!< USART2 clock when sleep mode */
    RCU_UART3_SLP       = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 19U),                 /*!< UART3 clock when sleep mode */
    RCU_UART4_SLP       = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 20U),                 /*!< UART4 clock when sleep mode */
    RCU_I2C0_SLP        = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 21U),                 /*!< I2C0 clock when sleep mode */
    RCU_I2C1_SLP        = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 22U),                 /*!< I2C1 clock when sleep mode */
    RCU_I2C2_SLP        = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 23U),                 /*!< I2C2 clock when sleep mode */
    RCU_I2C3_SLP        = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 24U),                 /*!< I2C3 clock when sleep mode */
    RCU_CTC_SLP         = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 27U),                 /*!< CTC clock when sleep mode */
    RCU_DACHOLD_SLP     = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 28U),                 /*!< DACHOLD clock when sleep mode */
    RCU_DAC_SLP         = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 29U),                 /*!< DAC clock when sleep mode */
    RCU_UART6_SLP       = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 30U),                 /*!< UART6 clock when sleep mode */
    RCU_UART7_SLP       = RCU_REGIDX_BIT(APB1SPEN_REG_OFFSET, 31U),                 /*!< UART7 clock when sleep mode */
    /* APB2 peripherals */
    RCU_TIMER0_SLP      = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 0U),                  /*!< TIMER0 clock when sleep mode */
    RCU_TIMER7_SLP      = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 1U),                  /*!< TIMER7 clock when sleep mode */
    RCU_USART0_SLP      = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 4U),                  /*!< USART0 clock when sleep mode */
    RCU_USART5_SLP      = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 5U),                  /*!< USART5 clock when sleep mode */
    RCU_ADC0_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 8U),                  /*!< ADC0 clock when sleep mode */
    RCU_ADC1_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 9U),                  /*!< ADC1 clock when sleep mode */
    RCU_ADC2_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 10U),                 /*!< ADC2 clock when sleep mode */
    RCU_SPI0_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 12U),                 /*!< SPI0 clock when sleep mode */
    RCU_SPI3_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 13U),                 /*!< SPI3 clock when sleep mode */
    RCU_TIMER14_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 16U),                 /*!< TIMER14 clock when sleep mode */
    RCU_TIMER15_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 17U),                 /*!< TIMER15 clock when sleep mode */
    RCU_TIMER16_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 18U),                 /*!< TIMER16 clock when sleep mode */
    RCU_HPDF_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 19U),                 /*!< HPDF clock when sleep mode */
    RCU_SPI4_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 20U),                 /*!< SPI4 clock when sleep mode */
    RCU_SPI5_SLP        = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 21U),                 /*!< SPI5 clock when sleep mode */
    RCU_TIMER40_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 25U),                 /*!< TIMER40 clock when sleep mode */
    RCU_TIMER41_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 26U),                 /*!< TIMER41 clock when sleep mode */
    RCU_TIMER42_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 27U),                 /*!< TIMER42 clock when sleep mode */
    RCU_TIMER43_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 28U),                 /*!< TIMER43 clock when sleep mode */
    RCU_TIMER44_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 29U),                 /*!< TIMER44 clock when sleep mode */
    RCU_EDOUT_SLP       = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 30U),                 /*!< EDOUT clock when sleep mode */
    RCU_TRIGSEL_SLP     = RCU_REGIDX_BIT(APB2SPEN_REG_OFFSET, 31U),                 /*!< TRIGSEL clock when sleep mode */
    /* APB3 peripherals */
    RCU_WWDGT_SLP       = RCU_REGIDX_BIT(APB3SPEN_REG_OFFSET, 1U),                  /*!< WWDGT clock when sleep mode */
    /* APB4 peripherals */
    RCU_SYSCFG_SLP      = RCU_REGIDX_BIT(APB4SPEN_REG_OFFSET, 0U),                  /*!< SYSCFG clock when sleep mode */
    RCU_CMP_SLP         = RCU_REGIDX_BIT(APB4SPEN_REG_OFFSET, 1U),                  /*!< CMP clock when sleep mode */
    RCU_VREF_SLP        = RCU_REGIDX_BIT(APB4SPEN_REG_OFFSET, 2U),                  /*!< VREF clock when sleep mode */
    RCU_LPDTS_SLP       = RCU_REGIDX_BIT(APB4SPEN_REG_OFFSET, 3U),                  /*!< LPDTS clock when sleep mode */
    RCU_PMU_SLP         = RCU_REGIDX_BIT(APB4SPEN_REG_OFFSET, 4U),                  /*!< PMU clock when sleep mode */
    /* APB2 additional peripherals */
    RCU_CAN0_SLP        = RCU_REGIDX_BIT(ADD_APB2SPEN_REG_OFFSET, 0U),              /*!< CAN0 clock when sleep mode */
    RCU_CAN1_SLP        = RCU_REGIDX_BIT(ADD_APB2SPEN_REG_OFFSET, 1U),              /*!< CAN1 clock when sleep mode */
    RCU_CAN2_SLP        = RCU_REGIDX_BIT(ADD_APB2SPEN_REG_OFFSET, 2U)               /*!< CAN2 clock when sleep mode */
} rcu_periph_sleep_enum;

