RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_rcu.h
/* USBHS prescaler factor */
#define USBCLKCTL_USBHSPSC(regval)        (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define RCU_USBHSPSC_DIV1                 USBCLKCTL_USBHSPSC(0)                     /*!< USBHS prescaler select CK_PLL1Q / 1 */
#define RCU_USBHSPSC_DIV2                 USBCLKCTL_USBHSPSC(1)                     /*!< USBHS prescaler select CK_PLL1Q / 2 */
#define RCU_USBHSPSC_DIV3                 USBCLKCTL_USBHSPSC(2)                     /*!< USBHS prescaler select CK_PLL1Q / 3 */
#define RCU_USBHSPSC_DIV4                 USBCLKCTL_USBHSPSC(3)                     /*!< USBHS prescaler select CK_PLL1Q / 4 */
#define RCU_USBHSPSC_DIV5                 USBCLKCTL_USBHSPSC(4)                     /*!< USBHS prescaler select CK_PLL1Q / 5 */
#define RCU_USBHSPSC_DIV6                 USBCLKCTL_USBHSPSC(5)                     /*!< USBHS prescaler select CK_PLL1Q / 6 */
#define RCU_USBHSPSC_DIV7                 USBCLKCTL_USBHSPSC(6)                     /*!< USBHS prescaler select CK_PLL1Q / 7 */
#define RCU_USBHSPSC_DIV8                 USBCLKCTL_USBHSPSC(7)                     /*!< USBHS prescaler select CK_PLL1Q / 8 */

/* USBHS 48MHz clock selection */
#define USBCLKCTL_USB48MSEL(regval)       (BITS(5,6) & ((uint32_t)(regval) << 5U))
#define RCU_USB48MSRC_PLL0R                USBCLKCTL_USB48MSEL(0)                   /*!< select PLL0R as USABHS 48MHz clock source */
#define RCU_USB48MSRC_PLLUSBHS            USBCLKCTL_USB48MSEL(1)                    /*!< select PLLUSBHS / USBHSDV as USABHS 48MHz clock source */
#define RCU_USB48MSRC_PLL1Q               USBCLKCTL_USB48MSEL(2)                    /*!< select PLL1Q / USBHSPSC as USABHS 48MHz clock source */
#define RCU_USB48MSRC_IRC48M              USBCLKCTL_USB48MSEL(3)                    /*!< select IRC48M as USABHS 48MHz clock source */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check system clock source configuration */
#define NOT_RCU_SYS_CLOCK_CONFIG(ck_sys)                (((ck_sys) != RCU_CKSYSSRC_IRC64MDIV) && ((ck_sys) != RCU_CKSYSSRC_HXTAL) && \
                                                         ((ck_sys) != RCU_CKSYSSRC_LPIRC4M) && ((ck_sys) != RCU_CKSYSSRC_PLL0P))
/* check AHB clock prescaler selection */
#define NOT_RCU_AHB_CKSYS_DIV(ck_ahb)                   (((ck_ahb) != RCU_AHB_CKSYS_DIV1)   && ((ck_ahb) != RCU_AHB_CKSYS_DIV2) && \
                                                         ((ck_ahb) != RCU_AHB_CKSYS_DIV4)   && ((ck_ahb) != RCU_AHB_CKSYS_DIV8) && \
                                                         ((ck_ahb) != RCU_AHB_CKSYS_DIV16)  && ((ck_ahb) != RCU_AHB_CKSYS_DIV64) && \
                                                         ((ck_ahb) != RCU_AHB_CKSYS_DIV128) && ((ck_ahb) != RCU_AHB_CKSYS_DIV256) && \
                                                         ((ck_ahb) != RCU_AHB_CKSYS_DIV512))
/* check APB1 clock prescaler selection */
#define NOT_RCU_APB1_CKAHB_DIV(ck_apb1)                  (((ck_apb1) != RCU_APB1_CKAHB_DIV1)  && ((ck_apb1) != RCU_APB1_CKAHB_DIV2) && \
                                                          ((ck_apb1) != RCU_APB1_CKAHB_DIV4)  && ((ck_apb1) != RCU_APB1_CKAHB_DIV8) && \
                                                          ((ck_apb1) != RCU_APB1_CKAHB_DIV16))
/* check APB2 clock prescaler selection */
#define NOT_RCU_APB2_CKAHB_DIV(ck_apb2)                  (((ck_apb2) != RCU_APB2_CKAHB_DIV1)  && ((ck_apb2) != RCU_APB2_CKAHB_DIV2) && \
                                                          ((ck_apb2) != RCU_APB2_CKAHB_DIV4)  && ((ck_apb2) != RCU_APB2_CKAHB_DIV8) && \
                                                          ((ck_apb2) != RCU_APB2_CKAHB_DIV16))
/* check APB3 clock prescaler selection */
#define NOT_RCU_APB3_CKAHB_DIV(ck_apb3)                  (((ck_apb3) != RCU_APB3_CKAHB_DIV1)  && ((ck_apb3) != RCU_APB3_CKAHB_DIV2) && \
                                                          ((ck_apb3) != RCU_APB3_CKAHB_DIV4)  && ((ck_apb3) != RCU_APB3_CKAHB_DIV8) && \
                                                          ((ck_apb3) != RCU_APB3_CKAHB_DIV16))
/* check APB4 clock prescaler selection */
#define NOT_RCU_APB4_CKAHB_DIV(ck_apb4)                  (((ck_apb4) != RCU_APB4_CKAHB_DIV1)  && ((ck_apb4) != RCU_APB4_CKAHB_DIV2) && \
                                                          ((ck_apb4) != RCU_APB4_CKAHB_DIV4)  && ((ck_apb4) != RCU_APB4_CKAHB_DIV8) && \
                                                          ((ck_apb4) != RCU_APB4_CKAHB_DIV16))
/* check CK_OUT0 clock source */
#define NOT_RCU_CKOUT0_SOURCE(ckout0_src)                (((ckout0_src) != RCU_CKOUT0SRC_IRC64MDIV) && ((ckout0_src) != RCU_CKOUT0SRC_LXTAL) && \
                                                          ((ckout0_src) != RCU_CKOUT0SRC_HXTAL)     && ((ckout0_src) != RCU_CKOUT0SRC_PLL0P) && \
                                                          ((ckout0_src) != RCU_CKOUT0SRC_IRC48M)    && ((ckout0_src) != RCU_CKOUT0SRC_PER) && \
                                                          ((ckout0_src) != RCU_CKOUT0SRC_USBHS060M) && ((ckout0_src) != RCU_CKOUT0SRC_USBHS160M))
/* check CK_OUT0 divider */
#define RCU_CKOUT0_LOW                                   RCU_CKOUT0_DIV1
#define RCU_CKOUT0_HIGH                                  RCU_CKOUT0_DIV15
#define NOT_RCU_CKOUT0_DIVIDER(ckout0_div)               (((RCU_CKOUT0_HIGH) < (ckout0_div)) || ((RCU_CKOUT0_LOW) > (ckout0_div)))
/* check CK_OUT1 clock source */
#define NOT_RCU_CKOUT1_SOURCE(ckout1_src)                (((ckout1_src) != RCU_CKOUT1SRC_SYSTEMCLOCK) && ((ckout1_src) != RCU_CKOUT1SRC_PLL1R) && \
                                                          ((ckout1_src) != RCU_CKOUT1SRC_HXTAL)       && ((ckout1_src) != RCU_CKOUT1SRC_PLL0P) && \
                                                          ((ckout1_src) != RCU_CKOUT1SRC_LPIRC4M)     && ((ckout1_src) != RCU_CKOUT1SRC_IRC32K) && \
                                                          ((ckout1_src) != RCU_CKOUT1SRC_PLL2R))
/* check CK_OUT1 divider */
#define RCU_CKOUT1_LOW                                   RCU_CKOUT1_DIV1
#define RCU_CKOUT1_HIGH                                  RCU_CKOUT1_DIV15
#define NOT_RCU_CKOUT1_DIVIDER(ckout1_div)               (((RCU_CKOUT1_HIGH) < (ckout1_div)) || ((RCU_CKOUT1_LOW) > (ckout1_div)))
/* check PLL input clock range */
#define NOT_RCU_PLL_INPUT_CLOCKK_RANGE(ck_input)         (((ck_input) != RCU_PLL0RNG_1M_2M)  && ((ck_input) != RCU_PLL0RNG_2M_4M) && \
                                                          ((ck_input) != RCU_PLL0RNG_4M_8M)  && ((ck_input) != RCU_PLL0RNG_8M_16M) && \
                                                          ((ck_input) != RCU_PLL1RNG_1M_2M)  && ((ck_input) != RCU_PLL1RNG_2M_4M) && \
                                                          ((ck_input) != RCU_PLL1RNG_4M_8M)  && ((ck_input) != RCU_PLL1RNG_8M_16M) && \
                                                          ((ck_input) != RCU_PLL2RNG_1M_2M)  && ((ck_input) != RCU_PLL2RNG_2M_4M) && \
                                                          ((ck_input) != RCU_PLL2RNG_4M_8M)  && ((ck_input) != RCU_PLL2RNG_8M_16M))
/* check PLL output clock range */
#define NOT_RCU_PLL_OUTPUT_CLOCKK_RANGE(ck_output)       (((ck_output) != RCU_PLL0VCO_192M_836M) && ((ck_output) != RCU_PLL0VCO_150M_420M) && \
                                                          ((ck_output) != RCU_PLL1VCO_192M_836M) && ((ck_output) != RCU_PLL1VCO_150M_420M) && \
                                                          ((ck_output) != RCU_PLL2VCO_192M_836M) && ((ck_output) != RCU_PLL2VCO_150M_420M))
/* check fractional part of the multiplication factor */
#define RCU_FRACN_HIGH                                     (0x1FFFF)
#define NOT_RCU_PLL_FRACN(pll_fracn)                      ((uint32_t)RCU_FRACN_HIGH < ((uint32_t)(pll_fracn)))
/* check PLL clock source */
#define NOT_RCU_PLL_SOURCE(pll_src)                      (((pll_src) != RCU_PLLSRC_IRC64MDIV) && ((pll_src) != RCU_PLLSRC_LPIRC4M) && \
                                                          ((pll_src) != RCU_PLLSRC_HXTAL))
/* check PLLP/PLLQ/PLLR divider */
#define NOT_RCU_PLLPQR_DIVIDER(pllxy)                    (((pllxy) != RCU_PLL0P) && ((pllxy) != RCU_PLL0Q) && \
                                                          ((pllxy) != RCU_PLL0R) && ((pllxy) != RCU_PLL1P) && \
                                                          ((pllxy) != RCU_PLL1Q) && ((pllxy) != RCU_PLL1R) && \
                                                          ((pllxy) != RCU_PLL2P) && ((pllxy) != RCU_PLL2Q) && \
                                                          ((pllxy) != RCU_PLL2R))
/* check PLLUSBHSPRE clock selection */
#define NOT_RCU_PLLUSB_PRESEL(pllusb_presel)             (((pllusb_presel) != RCU_PLLUSBHSPRE_HXTAL) && ((pllusb_presel) != RCU_PLLUSBHSPRE_IRC48M))
/* check PLLUSBHS clock divider */
#define RCU_PLLUSBHS_DIVIDER_LOW                          RCU_PLLUSBHSPRE_DIV1
#define RCU_PLLUSBHS_DIVIDER_HIGH                         RCU_PLLUSBHSPRE_DIV15
#define NOT_RCU_PLLUSBHS_DIVIDER(pllusb_predv)           (((RCU_PLLUSBHS_DIVIDER_HIGH) < (pllusb_predv)) || ((RCU_PLLUSBHS_DIVIDER_LOW) > (pllusb_predv)))
/* check PLLUSBHS0 clock multiplication factor */
#define RCU_PLLUSBHS_MULTI_LOW                            RCU_PLLUSBHS_MUL16
#define RCU_PLLUSBHS_MULTI_HIGH                           RCU_PLLUSBHS_MUL127
#define NOT_RCU_PLLUSBHS_MULTI(pllusb_mf)                (((RCU_PLLUSBHS_MULTI_HIGH) < (pllusb_mf)) || ((RCU_PLLUSBHS_MULTI_LOW) > (pllusb_mf)))
/* check USBHSDV clock divider */
#define RCU_USBHS_DIVIDER_HIGH                           (RCU_USBHS_DIV16 >> 4U)
#define NOT_RCU_USBHS_DIVIDER(usbhsdv)                   ((RCU_USBHS_DIVIDER_HIGH) < ((usbhsdv)>> 4U))
/* check RTC clock source */
#define NOT_RCU_RTC_CLOCK_SOURCE(rtc_clock_source)       (((rtc_clock_source) != RCU_RTCSRC_NONE) && ((rtc_clock_source) != RCU_RTCSRC_LXTAL) && \
                                                          ((rtc_clock_source) != RCU_RTCSRC_IRC32K) && ((rtc_clock_source) != RCU_RTCSRC_HXTAL_DIV_RTCDIV))
/* check RTC clock divider */
#define RCU_RTC_DIVIDER_HIGH                             ((RCU_RTC_HXTAL_DIV63) >> 16U)
#define NOT_RCU_RTC_DIVIDER(rtc_div)                     (((RCU_RTC_DIVIDER_HIGH) < ((rtc_div) >> 16U)))
/* check CK48M clock source */
#define NOT_RCU_CK48M_CLOCK_SOURCE(ck48m_clock_source)   (((ck48m_clock_source) != RCU_CK48MSRC_PLL48M) && ((ck48m_clock_source) != RCU_CK48MSRC_IRC48M))
/* check PLL48M clock source */
#define NOT_RCU_PLL48M_CLOCK_SOURCE(pll48m_clock_source) (((pll48m_clock_source) != RCU_PLL48MSRC_PLL0Q) && ((pll48m_clock_source) != RCU_PLL48MSRC_PLL2P))
/* check IRC64M clock divider */
#define NOT_RCU_IRC64M_CLOCK_DIV(ck_irc64mdiv)        (((ck_irc64mdiv) != RCU_IRC64M_DIV1) && ((ck_irc64mdiv) != RCU_IRC64M_DIV2) && \
                                                          ((ck_irc64mdiv) != RCU_IRC64M_DIV4) && ((ck_irc64mdiv) != RCU_IRC64M_DIV8))
/* check TIMER prescaler selection */
#define NOT_RCU_TIMER_PRE_SEL(timer_clock_prescaler)     (((timer_clock_prescaler) != RCU_TIMER_PSC_MUL2) && ((timer_clock_prescaler) != RCU_TIMER_PSC_MUL4))
/* check SPI clock selection */
#define NOT_RCU_SPISRC_SEL(ck_spi)                       (((ck_spi) != RCU_SPISRC_PLL0Q)     && ((ck_spi) != RCU_SPISRC_PLL1P) && \
                                                          ((ck_spi) != RCU_SPISRC_PLL2P)     && ((ck_spi) != RCU_SPISRC_I2S_CKIN) && \
                                                          ((ck_spi) != RCU_SPISRC_PER)       && ((ck_spi) != RCU_SPISRC_APB2) && \
                                                          ((ck_spi) != RCU_SPISRC_PLL1Q)     && ((ck_spi) != RCU_SPISRC_PLL2Q) && \
                                                          ((ck_spi) != RCU_SPISRC_IRC64MDIV) && ((ck_spi) != RCU_SPISRC_LPIRC4M) && \
                                                          ((ck_spi) != RCU_SPISRC_HXTAL)     && ((ck_spi) != RCU_SPI5SRC_I2S_CKIN))
/* check Deep-sleep wakeup system clock source selection */
#define NOT_RCU_DSPWUSSEL(ck_dspwussel)                  (((ck_dspwussel) != RCU_DSPWUSSEL_IRC64MDIV) && ((ck_dspwussel) != RCU_DSPWUSSEL_LPIRC4M))
/* check USART clock selection */
#define NOT_RCU_USARTSRC_SEL(ck_usart)                   (((ck_usart) != RCU_USARTSRC_APB)       && ((ck_usart) != RCU_USARTSRC_AHB) && \
                                                          ((ck_usart) != RCU_USARTSRC_LXTAL)     && ((ck_usart) != RCU_USARTSRC_IRC64MDIV))
/* check I2C clock selection */
#define NOT_RCU_I2CSRC_SEL(ck_i2c)                       (((ck_i2c) != RCU_I2CSRC_APB1)      && ((ck_i2c) != RCU_I2CSRC_PLL2R) && \
                                                          ((ck_i2c) != RCU_I2CSRC_IRC64MDIV) && ((ck_i2c) != RCU_I2CSRC_LPIRC4M))
/* check CAN clock selection */
#define NOT_RCU_CANSRC_SEL(ck_can)                       (((ck_can) != RCU_CANSRC_HXTAL)     && ((ck_can) != RCU_CANSRC_APB2) && \
                                                          ((ck_can) != RCU_CANSRC_APB2_DIV2) && ((ck_can) != RCU_CANSRC_IRC64MDIV))
/* check ADC clock selection */
#define NOT_RCU_ADCSRC_SEL(ck_adc)                       (((ck_adc) != RCU_ADCSRC_PLL1P) && ((ck_adc) != RCU_ADCSRC_PLL2R) && \
                                                          ((ck_adc) != RCU_ADCSRC_PER))
/* check EXMC clock selection */
#define NOT_RCU_EXMCSRC_SEL(ck_exmc)                     (((ck_exmc) != RCU_EXMCSRC_AHB)   && ((ck_exmc) != RCU_EXMCSRC_PLL0Q) && \
                                                          ((ck_exmc) != RCU_EXMCSRC_PLL1R) && ((ck_exmc) != RCU_EXMCSRC_PER))
/* check HPDF audio clock selection */
#define NOT_RCU_HPDFASRC_SEL(ck_hpdfa)                     (((ck_hpdfa) != RCU_HPDFASRC_PLL0Q) && ((ck_hpdfa) != RCU_HPDFASRC_PLL1P) && \
                                                            ((ck_hpdfa) != RCU_HPDFASRC_PLL2P) && ((ck_hpdfa) != RCU_HPDFASRC_I2S_CKIN) && \
                                                            ((ck_hpdfa) != RCU_HPDFASRC_PER))
/* check HPDF clock selection */
#define NOT_RCU_HPDFSRC_SEL(ck_hpdf)                     (((ck_hpdf) != RCU_HPDFSRC_APB2) && ((ck_hpdf) != RCU_HPDFSRC_AHB))
/* check PER clock selection */
#define NOT_RCU_PERSRC_SEL(ck_per)                       (((ck_per) != RCU_PERSRC_IRC64MDIV) && ((ck_per) != RCU_PERSRC_LPIRC4M) && \
                                                          ((ck_per) != RCU_PERSRC_HXTAL))
/* check PLL1Q USBHS prescaler divider */
#define RCU_PLL1Q_USBHS_DIVIDER_HIGH                     (RCU_USBHSPSC_DIV8 >> 16U)
#define NOT_RCU_USBHSPSC(ck_usbhspsc)                    ((RCU_PLL1Q_USBHS_DIVIDER_HIGH) < ((ck_usbhspsc) >> 16U))
/* check USB48M clock selection */
#define NOT_RCU_USB48MSRC_SEL(ck_usb48m)                 (((ck_usb48m) != RCU_USB48MSRC_PLL0R)    && ((ck_usb48m) != RCU_USB48MSRC_PLLUSBHS) && \
                                                          ((ck_usb48m) != RCU_USB48MSRC_PLL1Q)    && ((ck_usb48m) != RCU_USB48MSRC_IRC48M))
/* check USBHS clock selection */
#define NOT_RCU_USBHS_SEL(ck_usbhs)                      (((ck_usbhs) != RCU_USBHSSEL_48M) && ((ck_usbhs) != RCU_USBHSSEL_60M))
/* check LXTAL drive capability */
#define NOT_RCU_LXTAL_DRICAP_SEL(lxtal_dricap)           (((lxtal_dricap) != RCU_LXTAL_LOWDRI)      && ((lxtal_dricap) != RCU_LXTAL_MED_LOWDRI) && \
                                                          ((lxtal_dricap) != RCU_LXTAL_MED_HIGHDRI) && ((lxtal_dricap) != RCU_LXTAL_HIGHDRI))
/* check IRC64M adjust value */
#define RCU_IRC64M_ADJUST_HIGH                           (0x7FU)
#define NOT_RCU_IRC64M_ADJUST_VALUE(irc64m_adjval)       (((RCU_IRC64M_ADJUST_HIGH) < (irc64m_adjval)))
/* check LPIRC4M adjust value */
#define RCU_LPIRC4M_ADJUST_HIGH                          (0x3FU)
#define NOT_RCU_LPIRC4M_ADJUST_VALUE(lpirc4m_adjval)     (((RCU_IRC64M_ADJUST_HIGH) < (lpirc4m_adjval)))
#endif

/* function declarations */
/* peripherals clock configure functions */
/* deinitialize the RCU */
void rcu_deinit(void);
/* enable the peripherals clock */
void rcu_periph_clock_enable(rcu_periph_enum periph);
/* disable the peripherals clock */
void rcu_periph_clock_disable(rcu_periph_enum periph);
/* enable the peripherals clock when sleep mode */
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph);
/* disable the peripherals clock when sleep mode */
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph);
/* reset the peripherals */
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset);
/* disable reset the peripheral */
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset);
/* reset the BKP */
void rcu_bkp_reset_enable(void);
/* disable the BKP reset */
void rcu_bkp_reset_disable(void);

/* system and peripherals clock source, system reset configure functions */
/* configure the system clock source */
void rcu_system_clock_source_config(uint32_t ck_sys);
/* get the system clock source */
uint32_t rcu_system_clock_source_get(void);
/* configure the AHB prescaler selection */
void rcu_ahb_clock_config(uint32_t ck_ahb);
/* configure the APB1 prescaler selection */
void rcu_apb1_clock_config(uint32_t ck_apb1);
/* configure the APB2 prescaler selection */
void rcu_apb2_clock_config(uint32_t ck_apb2);
/* configure the APB3 prescaler selection */
void rcu_apb3_clock_config(uint32_t ck_apb3);
/* configure the APB4 prescaler selection */
void rcu_apb4_clock_config(uint32_t ck_apb4);
/* configure the CK_OUT0 clock source and divider */
void rcu_ckout0_config(uint32_t ckout0_src, uint32_t ckout0_div);
/* configure the CK_OUT1 clock source and divider */
void rcu_ckout1_config(uint32_t ckout1_src, uint32_t ckout1_div);

